app/Controllers/Home.php

SELECT *
FROM `t_usuarios`
WHERE `usuario` = 'Oscar'
 LIMIT 1
---
     public function registrar (){


           $ruser = $this->request->getPost('input-user');
$rpass = $this->request->getPost('input-pass');
$rrol  = $this->request->getPost('input-rol');

// 2. Instanciar el Modelo correctamente
$fuser = new \App\Models\Usuarios();

// 3. Verificar si el usuario ya existe (USANDO EL MODELO)
$existente = $fuser->where('usuario', $ruser)->first();