app/Models/consultadorDatos.php

        public function consultarDatos($date = []){

        $build = $this->db->table('t_usuarios');

        if (!empty($date)) {
            $build->where($date);
        }

        return $build->get()->getResultArray();
---
SELECT *
FROM `t_usuarios`