app/Models/Usuarios.php

SELECT *
FROM `t_usuarios`
WHERE `usuario` = 'Ray'
---
        public function obtenerUsuario($data){

            $Usuario = $this->db->table('t_usuarios');
            $Usuario->where($data);
            return $Usuario->get()->getResultArray();

INSERT INTO `t_usuarios` (`usuario`, `password`, `rol`) VALUES ('Oscar', '$2y$10$.nnSm.rDtO7mldwoA7qWdOpTbgmqrq2t6/kYNpmm/nL86Neq0S4nK', 'admin')
---
        public function insertarUsuario($data) {
            $builder = $this->db->table('t_usuarios');
            return $builder->insert($data);